# Используем базовый образ Python 3.8 slim
FROM python:3.8-slim

# Установка рабочей директории внутри контейнера
WORKDIR /app

# Копирование всех файлов в текущую рабочую директорию внутри контейнера
COPY . .

# Установка зависимостей из requirements.txt
RUN pip install --no-cache-dir --upgrade -r requirements.txt

# Копирование всех файлов еще раз (возможно, не нужно, но это зависит от вашего проекта)
COPY . .

# Команда для запуска приложения при старте контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
